//
//  SDWebImage.swift
//  SPMsAndSDKs
//
//  Created by Алан Парастаев on 23.11.2025.
//

/*
 ✴️ SDWebImageSwiftUI — библиотека для загрузки изображений из сети:
    ➡️ умеет кэшировать
    ➡️ умеет показывать placeholder
    ➡️ предоставляет компонент WebImage
 */
import SwiftUI
import SDWebImageSwiftUI


/*
  🟡 SDWedImageLoader → отвечает за непосредственно загрузку изображения через SDWebImage
 
  🟢 WebImage(url:)
     Компонент SDWebImageSwiftUI.Асинхронно скачивает изображение по URL и кэширует его
     автоматически обновляет UI, когда загрузка закончена

  🟢 .resizable()
     Делает изображение изменяемым по размеру.

  🟢 .aspectRatio(...)
      Настраивает, как изменяется размер изображения:
     .fill — заполнить контейнер, возможно обрезав
     .fit — вписать без обрезки
 */
 struct SDWedImageLoader: View {
    
    let url: String
    var contentMode: ContentMode = .fill
    
    var body: some View {
        WebImage(url: URL(string: url))
            .resizable()
            .aspectRatio(contentMode: contentMode)
    }
}


/*
 🟡 SDWebImage → строит кнопку, внутри которой размещается изображение из интернета.
   ⚠️ B нутри Button { другая кнопка SDWedImageLoader с изображением
 
 🟢 SDWedImageLoader(url: ..., contentMode: .fill)
   Загружчик изображения

 🟢 .onAppear
    Код внутри выполнится при появлении кнопки на экране.
    ImagePrefetcher.instance.startPrefetching(...), это мы вызываем презагрузчик картинок заранее для будущих экранов ,что бы когда пользователь перйдет на следуйщий экран картинки отобразились мгновенно
 */
struct SDWebImage: View {
    var body: some View {
        Button {
            
        } label: {
            ImageLoader(
                url: "https://picsum.photos/id/237/200/300",
                contentMode: .fill
            )
            .frame(width: 200, height: 200)
            .onAppear {
               // ImagePrefetcher.instance.startPrefetching(urls: )
            }
        }

        
    }
}

#Preview {
    SDWebImage()
}
