//
//  ImageLoader.swift
//  SPMsAndSDKs
//
//  Created by Алан Парастаев on 25.11.2025.
//

import SwiftUI

/*
✴️ ImageLoader — это обёртка для загрузчика картинки (SDWedImageLoader или KINGFISHER) через overlay позволяющая накладывать изображение поверх невидимого контейнера.

 🔴  Эта структура(ImageLoader) обёртка, она нужна что бы в будущем если понадобится рефактеринг, если к примеру я захочу сменить SDK например на KINGFISHER мне просто достаточно будет поменятьт код в overlay или добавить второй SDK черз if else и приложение будет работать ведь все преложение работает через вызов ImageLoader
 
     ⚠️ ImageLoader ОБЩИЙ ЗАГРУЗЧИК ИЗОБРАЖЕНИЙ ИМЕННО ЕГО МЫ УКАЗЫАЕМ В ОСНОВНОЙ СТРУКТУРЕ И ЧЕРЕЗ НЕГО РАБОТАЕМ ВО ВСЕМ ПРИЛОЖЕНИИ, А ОН В СВОЮ ОЧЕРЕДЬ ОБРАЩАЕТСЯ К SDWedImageLoader

 🟢 url — строка с URL картинки.
 🟢 contentMode — параметр, как картинка вписывается в контейнер (.fill или .fit).

 🟢 Rectangle().opacity(0)
    ➡️ Основа просмотра — пустой Rectangle()
    ➡️ Создаёт прямоугольник, НЕ видимый на экране (прозрачность = 0).
    ⚠️ Прямоугольник(Rectangle()) это подложка(контейнер), поверх которого можно наложить картинку, это необходимо что бы катринка правильно обрезалась

  🟢 .overlay {
     SDWedImageLoader(...)
         .allowsHitTesting(false)
     }
    ➡️ В overlay кладётся другая вью, которая визуально находится поверх прямоугольника.
    ⚠️ allowsHitTesting(false) отключает взаимодействие пользователя (по касаниям), тоесть на картинку мы не можем нажать, но если вставить такую картинку в кнопку(Button) она будет раотать но по факту будем нажимать и взаимодествовать через подложку(прямоугольник)

  🟢 .clipped()
     ➡️ Обрезает изображение по границам контейнера.
     ➡️ Если картинка больше контейнера → лишнее не отображается.
 */
struct ImageLoader: View {
    
    let url: String
    var contentMode: ContentMode = .fill
    
    var body: some View {
        Rectangle()
            .opacity(0)
            .overlay {
                SDWedImageLoader(url: url, contentMode: contentMode)
                //KingfisherImageLoader(url: url, contentMode: contentMode)
                    .allowsHitTesting(false)
            }
            .clipped()
    }
}

#Preview {
    ImageLoader(
        url: "https://picsum.photos/id/237/200/300",
        contentMode: .fill
    )
}
